## Pandas Learning | 04-01-67

### Import Pandas

In [6]:
import pandas as pd

### .Series()

In [7]:
s1 = pd.Series([50,60,70,80])

In [8]:
s1

0    50
1    60
2    70
3    80
dtype: int64

In [9]:
s1[2]

70

In [10]:
s2 = pd.Series([50,60,70,80],index = ['a','b','c','d'])

In [11]:
s2

a    50
b    60
c    70
d    80
dtype: int64

In [12]:
s2['c']

70

In [13]:
s2[2]

C:\Users\HP\AppData\Local\Temp\ipykernel_21156\3318850340.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[2]

70

#### .Series() slicing

In [14]:
s2[1:4]

b    60
c    70
d    80
dtype: int64

In [15]:
s1[2:3]

2    70
dtype: int64

#### .DataFrame()

In [16]:
import numpy as np
from numpy import random as rd

In [17]:
df1 = pd.DataFrame(rd.randint(0,50,[5,4]))

In [18]:
df1

    0   1   2   3
0   8  20  24  27
1  25  44  45  44
2  18  28   0  26
3   8  13  45  36
4   5  30  27  28

In [19]:
df2 = pd.DataFrame(rd.randint(0, 30, [6, 6]),
                   index=("a b c d e f".split()),
                   columns=("g h i j k l".split()))

In [20]:
df2

    g   h   i   j   k   l
a  27  27  21  23   8  17
b  21   5   9  23  15  20
c  25   1  25  12   0  20
d  11  10   8  27  19  23
e  27  14  28  24  25  19
f  14  10   9   2  28  20

In [21]:
df2.h

a    27
b     5
c     1
d    10
e    14
f    10
Name: h, dtype: int32

In [22]:
df2.h['d']

10

#### .loc()

In [23]:
df2.loc['d']

g    11
h    10
i     8
j    27
k    19
l    23
Name: d, dtype: int32

In [24]:
df2.loc['d']['g']

11

In [25]:
df2.loc[['b','d']]

    g   h  i   j   k   l
b  21   5  9  23  15  20
d  11  10  8  27  19  23

#### .loc() silcing

In [26]:
df2.loc['b':'d',['k','l']]

    k   l
b  15  20
c   0  20
d  19  23

In [27]:
df2>30

       g      h      i      j      k      l
a  False  False  False  False  False  False
b  False  False  False  False  False  False
c  False  False  False  False  False  False
d  False  False  False  False  False  False
e  False  False  False  False  False  False
f  False  False  False  False  False  False

In [28]:
df2['g']>20

a     True
b     True
c     True
d    False
e     True
f    False
Name: g, dtype: bool

In [29]:
df2

    g   h   i   j   k   l
a  27  27  21  23   8  17
b  21   5   9  23  15  20
c  25   1  25  12   0  20
d  11  10   8  27  19  23
e  27  14  28  24  25  19
f  14  10   9   2  28  20

In [30]:
df2[df2['g'].between(20, 29)]

    g   h   i   j   k   l
a  27  27  21  23   8  17
b  21   5   9  23  15  20
c  25   1  25  12   0  20
e  27  14  28  24  25  19

In [31]:
df2[df2['g']>20].loc['c']

g    25
h     1
i    25
j    12
k     0
l    20
Name: c, dtype: int32

In [32]:
df2[(df2['g']>20)&(df2['k']<30)]

    g   h   i   j   k   l
a  27  27  21  23   8  17
b  21   5   9  23  15  20
c  25   1  25  12   0  20
e  27  14  28  24  25  19

In [33]:
data = {
    'Company' : ['SCG','SCG','PTT','PTT','KTB','KTB'],
    'Person' : list("ABCDEF"),
    'Sales' : [200,300,450,100,140,350]
}

In [34]:
df3  = pd.DataFrame(data)
df3

  Company Person  Sales
0     SCG      A    200
1     SCG      B    300
2     PTT      C    450
3     PTT      D    100
4     KTB      E    140
5     KTB      F    350

In [35]:
df3.groupby('Company')

In [36]:
df3.groupby('Company').sum()

        Person  Sales
Company
KTB         EF    490
PTT         CD    550
SCG         AB    500

In [37]:
df3.groupby('Company').sum()['Sales']

Company
KTB    490
PTT    550
SCG    500
Name: Sales, dtype: int64

In [38]:
df3.groupby('Company').sum().loc['SCG']

Person     AB
Sales     500
Name: SCG, dtype: object

In [39]:
df3.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
KTB       2.0  245.0  148.492424  140.0  192.5  245.0  297.5  350.0
PTT       2.0  275.0  247.487373  100.0  187.5  275.0  362.5  450.0
SCG       2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0

In [40]:
df3.groupby('Company').describe().transpose()

Company             KTB         PTT         SCG
Sales count    2.000000    2.000000    2.000000
      mean   245.000000  275.000000  250.000000
      std    148.492424  247.487373   70.710678
      min    140.000000  100.000000  200.000000
      25%    192.500000  187.500000  225.000000
      50%    245.000000  275.000000  250.000000
      75%    297.500000  362.500000  275.000000
      max    350.000000  450.000000  300.000000

In [41]:
df3['Company'].unique()

array(['SCG', 'PTT', 'KTB'], dtype=object)

In [42]:
df3['Company'].value_counts()

Company
SCG    2
PTT    2
KTB    2
Name: count, dtype: int64

In [43]:
df3['Company'].nunique()

3

In [44]:
df3[df3['Sales'] == 200]

  Company Person  Sales
0     SCG      A    200

In [45]:
df3['Sales'].max()

450

In [46]:
df3[df3['Sales'] == df3['Sales'].max()]

  Company Person  Sales
2     PTT      C    450

#### .apply()

In [47]:
def fn(x):
    return x*2

In [48]:
df3

  Company Person  Sales
0     SCG      A    200
1     SCG      B    300
2     PTT      C    450
3     PTT      D    100
4     KTB      E    140
5     KTB      F    350

In [49]:
df3['Sales'].apply(fn)

0    400
1    600
2    900
3    200
4    280
5    700
Name: Sales, dtype: int64

In [50]:
df3['Sales']

0    200
1    300
2    450
3    100
4    140
5    350
Name: Sales, dtype: int64

In [54]:
df4 = pd.read_excel("Sample - Superstore.xls")

In [55]:
df4

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,9990,CA-2014-110422,2014-01-21,2014-01-23,Second Class,TB-21400,Tom Boeckenhauer,Consumer,United States,Miami,...,33180,South,FUR-FU-10001889,Furniture,Furnishings,Ultra Door Pull Handle,25.2480,3,0.20,4.1028
9990,9991,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,FUR-FU-10000747,Furniture,Furnishings,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.9600,2,0.00,15.6332
9991,9992,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,TEC-PH-10003645,Technology,Phones,Aastra 57i VoIP phone,258.5760,2,0.20,19.3932
9992,9993,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.6000,4,0.00,13.3200
9993,9994,CA-2017-119914,2017-05-04,2017-05-09,Second Class,CC-12220,Chris Cortes,Consumer,United States,Westminster,...,92683,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.1600,2,0.00,72.9480

In [58]:
df4.tail()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
9989,9990,CA-2014-110422,2014-01-21,2014-01-23,Second Class,TB-21400,Tom Boeckenhauer,Consumer,United States,Miami,...,33180,South,FUR-FU-10001889,Furniture,Furnishings,Ultra Door Pull Handle,25.248,3,0.2,4.1028
9990,9991,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,FUR-FU-10000747,Furniture,Furnishings,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.960,2,0.0,15.6332
9991,9992,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,TEC-PH-10003645,Technology,Phones,Aastra 57i VoIP phone,258.576,2,0.2,19.3932
9992,9993,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.600,4,0.0,13.3200
9993,9994,CA-2017-119914,2017-05-04,2017-05-09,Second Class,CC-12220,Chris Cortes,Consumer,United States,Westminster,...,92683,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.160,2,0.0,72.9480

In [59]:
df4.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [67]:
df4['Sales'].sort_values()

4101        0.444
9292        0.556
8658        0.836
4711        0.852
2106        0.876
          ...
4190    10499.970
2623    11199.968
8153    13999.960
6826    17499.950
2697    22638.480
Name: Sales, Length: 9994, dtype: float64

In [62]:
df4.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [72]:
df4['Ship Mode'].unique()

array(['Second Class', 'Standard Class', 'First Class', 'Same Day'],
      dtype=object)

In [73]:
df4['Ship Mode'].nunique()

4

In [74]:
df4.loc[1]

Row ID                                                           2
Order ID                                            CA-2016-152156
Order Date                                     2016-11-08 00:00:00
Ship Date                                      2016-11-11 00:00:00
Ship Mode                                             Second Class
Customer ID                                               CG-12520
Customer Name                                          Claire Gute
Segment                                                   Consumer
Country                                              United States
City                                                     Henderson
State                                                     Kentucky
Postal Code                                                  42420
Region                                                       South
Product ID                                         FUR-CH-10000454
Category                                                 Furniture
Sub-Category                                                Chairs
Product Name     Hon Deluxe Fabric Upholstered Stacking Chairs,...
Sales                                                       731.94
Quantity                                                         3
Discount                                                       0.0
Profit                                                     219.582
Name: 1, dtype: object

In [79]:
df4.loc[2].transpose()

Row ID                                                           3
Order ID                                            CA-2016-138688
Order Date                                     2016-06-12 00:00:00
Ship Date                                      2016-06-16 00:00:00
Ship Mode                                             Second Class
Customer ID                                               DV-13045
Customer Name                                      Darrin Van Huff
Segment                                                  Corporate
Country                                              United States
City                                                   Los Angeles
State                                                   California
Postal Code                                                  90036
Region                                                        West
Product ID                                         OFF-LA-10000240
Category                                           Office Supplies
Sub-Category                                                Labels
Product Name     Self-Adhesive Address Labels for Typewriters b...
Sales                                                        14.62
Quantity                                                         2
Discount                                                       0.0
Profit                                                      6.8714
Name: 2, dtype: object

In [81]:
df4['Category'].max()

'Technology'

In [89]:
df4.groupby('Customer Name')['Profit'].sum().max()

8981.3239

In [90]:
df4.groupby('Customer Name')['Profit'].sum() == df4.groupby('Customer Name')['Profit'].sum().max()

Customer Name
Aaron Bergman         False
Aaron Hawkins         False
Aaron Smayling        False
Adam Bellavance       False
Adam Hart             False
                      ...
Xylona Preis          False
Yana Sorensen         False
Yoseph Carroll        False
Zuschuss Carroll      False
Zuschuss Donatelli    False
Name: Profit, Length: 793, dtype: bool

In [94]:
df4.groupby('Customer Name')['Profit'].sum()[df4.groupby('Customer Name')['Profit'].sum() == df4.groupby('Customer Name')['Profit'].sum().max()]

Customer Name
Tamara Chand    8981.3239
Name: Profit, dtype: float64